custom_models/cyl_modified_mesh/Oldroyd-BLog/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       24579;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          172;
        startFace       24619;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          189;
        startFace       24791;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       24980;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          24894;
        startFace       25040;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          169;
        startFace       49934;
    }
)

// ************************************************************************* //
